firn_docs/mathematics/linear_algebra/KBe21math530retAxler5C7.tex
% Created 2021-09-27 Mon 11:53
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setlength{\parindent}{0pt}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{svg}
\usepackage{cancel}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\renewcommand{\tableofcontents}{}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Yoav, Albert}
\date{\today}
\title{Axler 5.C exercise 7}
\hypersetup{
 pdfauthor={Yoav, Albert},
 pdftitle={Axler 5.C exercise 7},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Export}
\label{sec:orge288496}
\url{https://www.overleaf.com/project/606b2fa8be363f9005d8ce03}

\section{Exercise 7}
\label{sec:org43fcfd9}
\begin{quote}
Suppose \(T \in  \mathcal{L} (V)\) has a diagonal matrix \(A\) with respect to some basis of \(V\) and that \(\lambda \in \mathbb{F}\). Prove that \(\lambda\) appears on the diagonal of \(A\) precisely \(\odim E(\lambda, T)\) times.
\end{quote}
\section{Proof}
\label{sec:org2d84d56}
We will show that for each eigenvalue \(\lambda\), there are at least \(E(\lambda, T)\) occurrences of that eigenvalue and at most \(E(\lambda, T)\) occurrences.

Suppose first that \(\dim E(\lambda , T) = m\) and \(v_1, \ldots, v_m\) is a basis of \(E(\lambda , T)\). In the diagonal matrix, the column corresponding to each of the \(m\) eigenvectors is comprised of the coefficients of
\[\begin{aligned}
  Tv_j = \lambda v_j
  \end{aligned}\]
The coefficients of an eigenvector linear combination are just the eigenvalue, so the associated eigenvalue (\(\lambda\)) appears once for each eigenvector. Thus, \(\lambda\) appears on the diagonal at least \(m\) times.

Suppose then that \(\lambda\) is on the diagonal \(m\) times. Each of those occurrences corresponds to where the diagonal matrix sends a (linearly independent) basis eigenvector, which implies that the basis of \(V\) has at least \(m\) eigenvectors corresponding to \(\lambda\). These \(m\) eigenvectors can be extended to a basis of \(E(\lambda, T)\), implying that \(\dim E(\lambda, T) \geq m\).
\end{document}
